docs/blog/gf-grammars.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-06-08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Developing grammars with GF</title>
<meta name="generator" content="Org mode">
<meta name="description" content="Pointers to begin learning Grammatical Framework (GF)."
>
<meta name="keywords" content="technical">
<link rel="stylesheet" href="/static/site.css"/><link rel="icon" type="image/x-icon" href="/static/favicon.ico"/></head>
<body>
<header id="top" class="status">
<div class="nav">
  <ul id="navlinks" class="horizontal-list">
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/blog/index.html">Blog</a>
    </li>
    <li>
      <a href="/about.html">About</a>
    </li>
  </ul>
</div>
</header>
<main id="content">
<header>
<h1 class="title">Developing grammars with GF</h1>
</header><p>
This is a short note to record a few pointers that should help a
newcomer learn <a href="http://grammaticalframework.org/">GF</a>. In case you don&rsquo;t know what GF is:
</p>

<blockquote>
<p>
Grammatical Framework (GF) is a domain-specific programming language
for grammar writing. It is a functional programming language, with
syntax inspired by the Haskell programming language; it draws from
intuitionistic type theory for its type system.
</p>
</blockquote>

<p>
I wrote a short introduction to GF in my <a href="http://hdl.handle.net/10438/27405">MSc thesis</a> (which is about
implementing a GF grammar for Portuguese), but the best source for
learning GF is pairing the <a href="http://www.grammaticalframework.org/gf-book/">GF book</a> with a read of <a href="https://inariksit.github.io/blog/">Inari Listenmaa&rsquo;s
blog</a>. If you don&rsquo;t have so much time as to read a book, you can
checkout the somewhat old <a href="http://www.grammaticalframework.org/doc/tutorial/gf-tutorial.html">GF tutorial</a> or the <a href="http://www.grammaticalframework.org/lib/doc/rgl-tutorial/index.html">GF Resource Grammar
Library (RGL) tutorial</a> (I&rsquo;d pick the former if you are more of a
programmer than a linguist, and the latter if the contrary).
</p>

<p>
Installing GF from binary is straightforward, and is probably the best
course of action if you are not familiar with Haskell (the language of
implementation) tooling. That&rsquo;s all you need for playing around, but
as soon as you want to contribute grammars you probably want to clone
the <a href="http://github.com/grammaticalframework/gf-rgl">RGL repository</a> and build the latest versions of its grammars (you
don&rsquo;t need Haskell for that, only <code>bash</code> or <code>cmd</code>).
</p>

<p>
If you need help or have questions the best forum is probably the the
<code>gf-dev</code> <a href="https://groups.google.com/forum/#!forum/gf-dev">mailing list</a>, but the <code>#gf</code> channel on freenode is good help
too.
</p>
</main>
</body>
</html>
